# Joel's macOS baseline. Run with: brew bundle --file Brewfile

# Core Unix/dev tools
brew "bash"
brew "bat"
brew "coreutils"
brew "curl"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "gh"
brew "jq"
brew "ripgrep"
brew "rsync"
brew "tree"
brew "wget"
brew "zoxide"

# Runtimes/package managers
brew "fnm"
brew "uv"
brew "python@3.12"
brew "pnpm"
brew "bun"

# Local services
brew "postgresql@17"
brew "valkey" # Redis-compatible OSS default
brew "redis"  # Keep Redis CLI/server around for projects that explicitly expect Redis

# Cloud/infrastructure
brew "awscli"
brew "cloudflare-wrangler"
brew "mkcert"
brew "vercel-cli"

# Terminal/editor/mux
brew "atuin"
brew "neovim"
brew "zellij"
brew "yqrashawn/goku/goku"

# GUI apps
cask "ghostty"
cask "karabiner-elements"
cask "tailscale"
cask "visual-studio-code"

# Fonts. Dank Mono is paid/manual; these are safe fallbacks.
cask "font-atkinson-hyperlegible"
cask "font-geist"
cask "font-jetbrains-mono"
cask "sf-symbols"
